<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"9effa62b9a86f73e16b97c6c8b61c2e9c2e9f57cc4707e1d378faf6ff26f1aa0","plan_job_ref":"Job Plan Airflow DAGs #149 at https://github.com/cal-itp/data-infra/actions/runs/15907737947","plan_out_hash":"2ca886047994c5b8ce8c9c41bf53f1de176feb8ad2b630835d0e62e85fc1ea22","plan_hash":"97f5b0271379856125caf17ba6854edab747765d73c7e82aa2b5532046ecb926","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_littlepay_v3/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "WIsFww==" -> (known after apply)
!~      detect_md5hash      = "hpHdgynpkUuuoDMRUEXtDQ==" -> "different hash"
!~      generation          = 1750906921324805 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_littlepay_v3/METADATA.yml"
!~      md5hash             = "hpHdgynpkUuuoDMRUEXtDQ==" -> (known after apply)
        name                = "dags/parse_littlepay_v3/METADATA.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (20 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #149](https://github.com/cal-itp/data-infra/actions/runs/15907737947)